{
    "title": "Allyson Jeffredo",
    "description": "Allyson Jeffredo is a poet, writer and educator originally from the Coachella Valley, but currently stationed in the Inland Empire. Her work can be found in numerous publications &ndash; both print and online. At the moment, she splits her time between teaching community college, community workshops and writing.",
    "content": "The language we speak has been determined for us by where we grew up, when we grew up and who we grew up with. So, inevitably, the ways we see the world has also been determined by these same influences—where, when and who. Yet, one of the most beautiful impacts of both art and writing is its ability to expand these innate limitations. Language allows us into the troves that are people. Language is a key into the unknown that is the \"other.\" As a writer and educator, I believe communication is one of the most difficult tasks we undergo every day. \n\nI happened upon this realization recently. When I was younger, I mentioned to an old boyfriend I wanted to teach. He replied with, \"Those who can, do. Those who can’t, teach.\" This saying haunted me. I wanted to do everything else but teach. For years afterwards, whenever anyone asked what I wanted to do with an English degree, I would instantly shift the conversation before we could get to: \"What else can you do besides teach?\" Yet, many things it turns out &ndash; [English is one of the top 10 most popular undergraduate majors for doctors](http://www.businessinsider.com/english-major-medical-school-doctors-2017-11).\n\nYears later, I began working with elementary school children during my graduate program at Cal State San Bernardino in a program called S.C.I.P.P. (Students and Coyotes Instruction in Poetry and Prose). Having to learn how to speak to children in a way that made them not simply _learn_ but _desire_ to learn was incredibly difficult.  If something wasn’t communicated effectively, an entire lesson would be lost. Later, when I began working with adults, nothing changed. The need to be clear and precise to develop the relevancy of the material was key. Each class became a pitch to learn. \n\nOur lives depend upon words, yet the value of these words can be unintentionally taken for granted. Words create the foundation for our relationships with ourselves, with others, and with the world around us. In a world that depends on the written word on a daily basis, the accuracy and potency of these words matter. I've dedicated my life to not only improving my own grasp of the English language but also the improvement of others. \n\nIf you find yourself unsure of the clarity of an essay, looking for direction for a group of poems, or desiring one-on-one mentoring for a larger project, contact me below for a free consultation.",
    "hero_background": "",
    "greeting": "Allyson Jeffredo",
    "tagline": "Poet. Writer. Educator.",
    "profile_image": "/static/uploads/profile.jpg",
    "keywords": ["Writing", "literature", "editing", "life"]
}
