{
    "title": "Publications",
    "description": "",
    "content": "The wise old Owl knew quite well that it would do no good to argue with the Grasshopper, nor with anybody else for that matter. Besides, her eyes were not sharp enough by day to permit her to punish the Grasshopper as he deserved. So she laid aside all hard words and spoke very kindly to him.",
    "publications": [
        {
            "title": "Only We Can Pull",
            "description": "There are moments when beauties come into being—the unbelievably small feet of a new born in your now grown hand, a salmon sky painted with cross-stitched contrails over a background of storm clouds—always or often where imbalance touches the border of another imbalance. Found: balance: a puzzle piece hanging off the table still grasping the edge of another.",
            "url": "http://ciderpressreview.com/tag/allyson-jeffredo/#.WeT2zFuPJhF",
            "type": "Poem"
        },
        {
            "title": "Inlandia Literary Journeys: Refugees’ experiences too powerful not to write about",
            "description": "During the summer, I worked with Glocally Connected — a nonprofit group founded by Sherry Mackay and Selin Yildiz Nielsen that provides free English classes primarily for Afghan and Syrian women refugees, and art and creative writing lessons for the children. In the introduction to her novel, “The House on Mango Street,\" Sandra Cisneros says, \"I write about my students because I don’t know what else to do with their stories. Writing them down allows me to sleep.\"",
            "url": "http://www.pe.com/2017/09/24/inlandia-literary-journeys-refugees-experiences-too-powerful-not-to-write-about/",
            "type": "Article"
        },
        {
            "title": "When I talk Too Much",
            "description": "My skin revolts at the flame of saying things I shouldn’t have, of falling into a guise too loose & too tight to handle  He talks as if he swallowed leaves the crunchy sound of ego sprawled on the tile, punch me, please, but I know better",
            "url": "https://cadencecollective.net/2016/10/16/when-i-talk-too-much/",
            "type": "Poem"
        },
        {
            "title": "He Says",
            "description": "When you were born, you missed the shore and dropped into the evening ocean. Where the waves crack the surface and you sink into darkness further from the sky. You’re caught in perpetual breast-stroke for the shivering air above, for the moist, raw shore of high tide.",
            "url": "https://cadencecollective.net/2016/11/24/he-says/",
            "type": "Poem"
        },
        {
            "title": "No Matter",
            "url": "http://www.hermeneuticchaosjournal.com/no-matter-by-allyson-jeffredo.html",
            "type": "Poem"
        },
        {
            "title": "As If",
            "description": "the bed may have been rumpled. our legs crescents of unmeaningful lilts drive into the bed skirt pushed early to flower, fraught to conceal our steep, off-pitch giggles. our mom’s face warps yellow & mistaken—we burst light bulbs misread in all directions—she thinks our bodies point at her, a hole in her sock or her coffee coils too electric. she, we, our arms a grove of disheveled yarn",
            "url": "http://www.literaryorphans.org/playdb/as-if-by-allyson-jeffredo/ ",
            "type": "Poem"
        },
        {
            "title": "Treasures: Pickles",
            "description": "As the sourness subdues my craving, the pickle bites memory into my tongue. When I was 12, I would chase pickles with creamy whole-milk, feel the milk shock my teeth like someone hooked jumper cables up to each tooth. My mom saw my scrunched face and laughed, That’s the same combination I’d crave when I was pregnant with you.",
            "url": "http://www.panoramajournal.org/treasures-pickles/",
            "type": "Poem"
        },
        {
            "title": "San Bernardino is Beautiful",
            "description": "On a stroll through San Bernardino’s business district last weekend, I came across a woman on a street corner gripping a teetering stack of fliers and an empty Big Gulp. As she struggled to hold everything in place, the Big Gulp slipped from the nook of her elbow, spilling the fliers all over the sidewalk. With a sigh, she bent down to collect them. A long-haired dachshund patiently watched the scene by her side.",
            "url": "http://www.zocalopublicsquare.org/2015/12/14/san-bernardino-is-beautiful/viewings/glimpses/",
            "type": "Article"
        },
        {
            "title": "Songs After Memory Fractures",
            "url": "https://www.finishinglinepress.com/product/songs-after-memory-fractures-by-allyson-jeffredo/ ",
            "type": "Book"
        },
        {
            "title": "Waist Trainer",
            "url": "https://thefemlitmag.com/waist-trainer-by-allyson-jeffredo-31422d3fe9f8",
            "type": "Poem"
        },
        {
            "title": "A Half Tale",
            "description": "THE BEIGING OF AMERICA, BEING MIXED RACE IN THE 21ST CENTURY, takes on “race matters” and considers them through the firsthand accounts of mixed race people in the United States. Edited by mixed race scholars Cathy J. Schlund-Vials, Sean Frederick Forbes and Tara Betts, this collection consists of 39 poets, writers, teachers, professors, artists and activists, whose personal narratives articulate the complexities of interracial life. Discrimination, instilling pride in family settings, sorting out the terms and names that people call themselves and their relatives, tackling colorism within communities of color, and childhood recollections fill these pages with compelling stories that speak to lived experiences, mapping a new ethnic terrain that transcends racial and cultural division",
            "url": "https://2leafpress.org/online/product/the-beiging-of-america/",
            "type": "Essay"
        },
        {
            "title": "Art, writing workshops help bring some healing from persistent violence",
            "description": "With the support of a California Humanities grant, Inlandia Literary Laureate Nikia Chaney, initiated a Voices Against Violence project, which uses the arts to address the violence experienced in Inland Empire communities.",
            "url": "https://www.pe.com/2018/06/30/art-writing-workshops-help-bring-some-healing-from-persistent-violence/",
            "type": "Article"
        },
        {
            "title": "Replenishing Your Art Will Also Replenish Your Much-Neglected Soul",
            "description": "Until I went on disability, I didn’t realize the state of neglect in which I have left my soul.",
            "url": "https://www.pe.com/2018/12/09/replenishing-your-art-will-also-replenish-your-much-neglected-soul/",
            "type": "Article"
        }
    ],
    "keywords": ["Writing", "literature", "editing", "life"]
}
